hkfuertes/amazon-remote-hid-bridge/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Debug mode: disable USB HID, use USB for serial console
# CONFIG_DEBUG_MODE is not set

# Hardware target: ESP32-S3-Zero
CONFIG_TARGET_HARDWARE_ESP32S3_ZERO=y

CONFIG_FREERTOS_HZ=1000

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# ESP32-specific
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Common ESP-related
#
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

#
# BT config
#
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_LOG_LEVEL_NONE=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=100
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144

# set the bonding configuration to configure the max number of bonded devices
# that can be remembered.
#
# NOTE: the MAX_CCCDS must be AT LEAST 6 * MAX_BONDS, otherwise the number of
# bonded devices allowed will be limited by the number of CCCDs / 6. The factor
# is determined by the number of notifications and indications that can be
# stored for each bonded device. For this reason, we've set max CCCDs to be very
# large so that they are not the limit.
CONFIG_BT_NIMBLE_MAX_BONDS=5
CONFIG_BT_NIMBLE_MAX_CCCDS=128

# Set the ESP-NIMBLE-CPP Config
CONFIG_NIMBLE_CPP_LOG_LEVEL_NONE=y

#
# TinyUSB config
#
CONFIG_TINYUSB_HID_COUNT=1

# Coredump support
CONFIG_ESP_COREDUMP_ENABLE=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y

# BLE Remote - target MAC (leave empty to connect to any HID device)
CONFIG_BLE_TARGET_MAC=""
